of-run/damBreakSwiftBlock/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/

// File was generated by SwiftBlock, a Blender 3D addon.

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (2.0 2.0 0.0)
    (2.0 0.0 0.0)
    (-1.1920928955078125e-07 1.7881393432617188e-07 0.0)
    (3.5762786865234375e-07 2.000000476837158 0.0)
    (2.0025148391723633 1.997462272644043 0.49427562952041626)
    (1.9974725246429443 -0.0025207996368408203 0.5008257627487183)
    (-0.0025148391723632812 0.0025376081466674805 0.5057244300842285)
    (0.0025269389152526855 2.0025203227996826 0.49917417764663696)
);
blocks
(
    hex (4 5 6 7 0 1 2 3)  (40 40 1) edgeGrading ( 1 1.0 1.0 1 1 1 1 1 1.0 1.0 1.0 1.0)
);

patches
(
    wall rightWall
    (
        (0 4 5 1)
    )
    wall leftWall
    (
        (2 6 7 3)
    )
    wall lowerWall
    (
        (1 5 6 2)
    )
    patch atmosphere
    (
        (4 0 3 7)
    )
    empty defaultFaces
    (
        (0 1 2 3)
        (4 7 6 5)
    )
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
